microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
  Remarks:
    None.
 */

void SetupGPIOPorts(void)
{
    // Reset all PORTx register (all inputs)
    #ifdef TRISA
        TRISA = 0x1F93;             // 0bUUU1 1111 1UU1 UU11
        LATA  = 0x0000;
    #endif
    #ifdef ANSELA
        ANSELA = 0x0000;            // 0bUUU0 0DDD DUU0 UU00
    #endif

    #ifdef TRISB
        TRISB = 0xFFFF;             // 0b1111 1111 1111 1111
        LATB  = 0x0000;
    #endif
    #ifdef ANSELB
        ANSELB = 0x0000;            // 0bDDDD DDD0 DDDD 0000
    #endif

    #ifdef TRISC
        TRISC = 0xBFFF;             // 0b1U11 1111 1111 1111
        LATC  = 0x0000;
    #endif
    #ifdef ANSELC
        ANSELC = 0x0000;            // 0bDUDD 0DDD DDDD D000
    #endif

    #ifdef TRISD
        TRISD = 0x0160;             // 0bUUUU UUU1 U11U UUUU
        LATD  = 0x0000;
    #endif
    #ifdef ANSELD
        ANSELD = 0x0000;            // 0bUUUU UUUU UUUU UUUU
    #endif

    #ifdef TRISE
        TRISE = 0xF000;             // 0b1111 UUUU UUUU UUUU
        LATE  = 0x0000;
    #endif
    #ifdef ANSELE
        ANSELE = 0x0000;            // 0b0000 UUUU UUUU UUUU
    #endif

    #ifdef TRISF
        TRISF = 0x0003;             // 0bUUUU UUUU UUUU UU11
        LATF  = 0x0000;
    #endif
    #ifdef ANSELF
        ANSELF = 0x0000;            // 0bUUUU UUUU UUUU UUUU
    #endif

    #ifdef TRISG
        TRISG = 0x03C0;             // 0bUUUU UU11 11UU UUUU 
        LATG  = 0x0000;
    #endif
    #ifdef ANSELG
        ANSELG = 0x0000;            // 0bUUUU UUUU UUUU UUUU 
    #endif

    MapGPIOHWFuntion();

    return;
}

// *****************************************************************************
/* Function:
    void InitOscillator(void)

  Summary:
    Routine to configure controller oscillator

  Description:
    Function configure oscillator PLL to generate desired processor clock

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitOscillator(void)

{
    /* Below equation provides relation between input frequency FIN(in MHz)and
     * Oscillator output frequency FOSC(in MHz)
     * Device Operating Frequency FCY(in MHz)is FOSC /2
     *
     *                    M                 (PLLDIV + 2)
     * FOSC  =  FIN * ---------- = -----------------------------------
     *                 (N1 * N2)    ((PLLPRE + 2)*(2 x (PLLPOST + 1)))
     *
     * where,
     * N1 = PLLPRE + 2
     * N2 = 2 x (PLLPOST + 1)
     * M = PLLDIV + 2
     */

#if (OSC_MODE == OSC_XTAL)

    /* If FIN (input frequency) = 8 MHz
     * FOSC (Oscillator output frequency)and FCY (Device Operating Frequency)is:
     *
     *                 M                   (68 + 2)            8 * 70
     * FOSC = FIN * --------- = 8 * ----------------------- = ------- = 140 MHz
     *              (N1 * N2)       ((0 + 2)*(2 x (0 + 1)))    2 * 2
     *
     * FCY = 140 MHz / 2 =  70 MHz
     *
     * where,
     * N1 = PLLPRE + 2 = 0 + 2 = 0
     * N2 = 2 * (PLLPOST + 1)= 2 * (0+1)= 2
     * M = PLLDIV + 2 = 68 + 2 = 70
     */

    /* PLLFBD: PLL FEEDBACK DIVISOR REGISTER(denoted as M,PLL multiplier)
     * M = (PLLFBDbits.PLLDIV+2)= (68+2) = 70                                 */
    PLLFBD = 68;

    /* PLL VCO Output Divider Select bits(denoted as N2, PLL post-scaler
     * N2 = 2 * (PLLPOST + 1)= 2 * (0+1)= 2                                   */
    CLKDIVbits.PLLPOST = 0;

    /* PLL Phase Detector I/P Divider Select bits(denoted as N1,PLL pre-scaler)
     * N1 = PLLPRE + 2 = 0 + 2 = 0                                            */
    CLKDIVbits.PLLPRE = 0;

    /* Initiate Clock Switch to Primary Oscillator with PLL (NOSC=0b011)
     *  NOSC = 0b011 = Primary Oscillator with PLL (XTPLL, HSPLL, ECPLL)      */
    __builtin_write_OSCCONH(0x03);

    /* Request oscillator switch to selection specified by the NOSC<2:0>bits  */
    __builtin_write_OSCCONL(0x01);

    /* Wait for Clock switch to occur */
    while (OSCCONbits.COSC != 0b011);

    /* Wait for PLL to lock */
    while (OSCCONbits.LOCK != 1);

#elif(OSC_MODE == OSC_FRC)

    /* If FIN (input frequency) = 7.37 MHz Internal RC Oscillator
     * FOSC (Oscillator output frequency)and FCY (Device Operating Frequency)is:
     *
     *         FIN * M         7.37 * (74 + 2)         7.37 * 76
     * FOSC = --------- = -----------------------  = ------------ = 140.03 MHz
     *        (N1 * N2)     ((0 + 2)*(2 x (0 + 1)))    (2 * 2)
     *
     * FCY = 140.03 MHz / 2 =  70.015 MHz
     *
     * where,
     * N1 = PLLPRE + 2 = 0 + 2 = 0
     * N2 = 2 * (PLLPOST + 1)= 2 * (0+1)= 2
     * M = PLLDIV + 2 = 74 + 2 = 76
     */

    /* PLLFBD: PLL FEEDBACK DIVISOR REGISTER(denoted as M,PLL multiplier)
     * M = (PLLFBDbits.PLLDIV+2)= (74+2) = 76                                 */
    PLLFBD = 74;

    /* PLL VCO Output Divider Select bits(denoted as N2, PLL post-scaler
     * N2 = 2 * (PLLPOST + 1)= 2 * (0+1)= 2                                   */
    CLKDIVbits.PLLPOST = 0;

    /* PLL Phase Detector I/P Divider Select bits(denoted as N1,PLL pre-scaler)
     * N1 = PLLPRE + 2 = 0 + 2 = 0                                            */
    CLKDIVbits.PLLPRE = 0;

    /* Initiate Clock Switch to FRC Oscillator with PLL (NOSC=0b001)
     *  NOSC = 0b001 = Fast RC Oscillator with PLL (FRCPLL)                   */
    __builtin_write_OSCCONH(0x01);

    /* Request oscillator switch to selection specified by the NOSC<2:0>bits  */
    __builtin_write_OSCCONL(0x01);

    /* Wait for Clock switch to occur */
    while (OSCCONbits.COSC != 0b001);

    /* Wait for PLL to lock */
    while (OSCCONbits.LOCK != 1);

#endif
}

// *****************************************************************************
/* Function:
    InitAmplifiersComparator()

  Summary:
    Routine to initialise Op-Amps and Comparator

  Description:
    Function initialise Op-Amps for motor current amplification;comparators for
    over current detection

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

