microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
  Remarks:
    None.
 */
void InitAmplifiersComparator(void)
{
    // CVR1CON: COMPARATOR VOLTAGE REFERENCE CONTROL REGISTER 1
    // CVREN <15>: 1 = Comparator voltage reference circuit powered on
    // CVROE <14>: 0 = CVREF voltage level is disconnected from CVREF10 pin
    // CVRSS <11>: 0 = Comparator reference source CVRSRC = AVDD-AVSS
    // VREFSEL <10>: 0 = CVREFIN is generated by the resistor network
    // Unimplemented <13,12,9,8,7>: Read as ?0?
    // CVR<6:0>: Comparator Voltage Reference Value Selection bits
    // CVREF = (CVR<6:0> / 128)* CVRSRC
    CVRCON = 0x0000;
 //   CVR1CONbits.CVR = CVREF_1;
 //   CVR1CONbits.CVREN = 1;

    // CVR2CON: COMPARATOR VOLTAGE REFERENCE CONTROL REGISTER 2
    // CVREN (15): 1 = Comparator voltage reference circuit powered on
    // CVROE (14): 0 = CVREF voltage level is disconnected from CVREF20 pin
    // CVRSS (11): 0 = Comparator reference source CVRSRC = AVDD-AVSS
    // VREFSEL (10): 0 = Reference source for inverting input is from CVR1,
    //                   when CVR1CONbits.VREFSEL = 0
    // Unimplemented <13,12,9,8,7>: Read as ?0?
    // CVR(6-0): Comparator Voltage Reference Value Selection bits
    // CVREF = (CVR<6:0> / 128)* CVRSRC
 //   CVR2CON = 0x0000;

    // CM4FLTR: COMPARATOR 4 FILTER CONTROL REGISTER
    // Unimplemented(15-7): Read as ?0?
    // CFSEL(6-4): 0b000 = Comparator Filter Input Clock is FP
    // CFLTREN(3): 1 = Comparator Digital Filter is enabled
    // CFDIV(2-0): 111 Comparator Filter Clock Divide 1:128
    CM4FLTR = 0x000F;

    // Op-AMP 1,3,5,2 for Signal Conditioning Currents &
    // Comparator 4 for Fault Generation
    
    // CMxCON: COMPARATOR x CONTROL REGISTER (x = 1, 2, 3 OR 5)
    // CON(15): Op Amp/Comparator Enable bit
    // COE(14): Comparator Output Enable bit
    //          Not applicable,when configured as Op-AMP
    // CPOL(13): Comparator Output Polarity Select bit
    //           Not applicable when configured as Op-AMP
    // OPAEN(10):1 = Op Amp Enable bit
    // CEVT(9): Comparator Event bit - Not applicable when configured as Op-AMP
    // COUT(8): Comparator Output bit - Not applicable when configured as Op-AMP
    // EVPOL(7-6): Trigger/Event/Interrupt Polarity Select bits
    //            Not applicable when configuring as Op-AMP
    // CREF(4): Comparator Reference Select bit (VIN+ input)
    // CCH(1-0): Op Amp/Comparator Channel Select bits
    // Unimplemented(3-2,5,12-11): Read as ?0?

    // OP-AMP/COMPARATOR 1 CONTROL REGISTER
    // Not used int this application
    CM1CON = 0x0000;            // 0b000U U000 00U0 UU00 ;

    // OP-AMP/COMPARATOR 2 CONTROL REGISTER
    // Not used int this application
    CM2CON = 0x0000;            // 0b000U U000 00U0 UU00 ;
    // OP-AMP/COMPARATOR 3 CONTROL REGISTER
    // Not used int this application
    CM1CON = 0x0000;            // 0b000U U000 00U0 UU00 ;

    // COMPARATOR 4 CONTROL REGISTER
    // Not used int this application
    CM4CON = 0x0000;            // 0b000U U100 00U0 UU00
    // Enable OP-AMP/COMPARATOR MODULE
    // Disable OA2 Module 
    CM2CONbits.CON = 0;
    // Enable OA1 Module 
    CM1CONbits.CON = 0;
    // Enable OA3 Module 
    CM3CONbits.CON = 0;
    // Enable CMP4 Module 
    CM4CONbits.CON = 0;

    return;
}

// *****************************************************************************
/* Function:
    InitPWMGenerators()

  Summary:
    Routine to initialise PWM Module for Inverters

  Description:
    Function initialises  and enable the PWM Module after configuration

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPWMGenerators(void)
{
    // PTCON: PWMx TIME BASE CONTROL REGISTER
    // PTEN(15): PWMx Module Enable bit
    // Unimplemented(14): Read as ?0?
    // PTSIDL(13): PWMx Time Base Stop in Idle Mode bit
    // SESTAT(12): Special Event Interrupt Status bit
    // SEIEN(11): Special Event Interrupt Enable bit
    // EIPU(1): Enable Immediate Period Updates bit(1)
    // SYNCPOL(9): Synchronize Input and Output Polarity bit(1)
    // SYNCOEN(8): Primary Time Base Sync Enable bit(1)
    // SYNCEN(7): External Time Base Synchronization Enable bit
    // SYNCSRC<(6-4): Synchronous Source Selection bits(1)
    // SEVTPS(3-0): PWMx Special Event Trigger Output Postscaler Select bits
    PTCON = 0;               // 0b0000 0000 0000 0000(PWM Module is disabled)
    PTCONbits.EIPU = 0;      // 0 = Active Period register updates occur
                             // on PWMx cycle boundaries

    // PTCON2: PWMx PRIMARY MASTER CLOCK DIVIDER SELECT REGISTER
    // Unimplemented(15-3): Read as ?0?
    // PCLKDIV(2-0): PWMx Input Clock Prescaler (Divider) Select bits
    PTCON2 = 0;              // 0b0000 0000 0000 0000(PWM Module is disabled)
    PTCON2bits.PCLKDIV = 0;  // 0b000 = Divide-by-1, max PWM timing resolution

    InitPWM123Generators();

    ChargeBootstarpCapacitors();

    PTCONbits.PTEN = 1;      // Enable PWM module after initialising generators


    return;
}

// *****************************************************************************
/* Function:
    InitPWM123Generators()

  Summary:
    Routine to initialise PWM generators 1,2,3 

  Description:
    Function initialises PWM module for 3-phase inverter control in Complimentary
    mode ;initialises period,dead time;Configures PWM fault control logic

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPWM123Generators(void)
{
    // PWMCONx: PWMx CONTROL REGISTER
    // FLTSTAT(15): Fault Interrupt Status bit
    // CLSTAT(14): Current-Limit Interrupt Status bit
    // TRGSTAT(13): Trigger Interrupt Status bit
    // FLTIEN(12): Fault Interrupt Enable bit
    // CLIEN(11): Current-Limit Interrupt Enable bit
    // TRGIEN(10): Trigger Interrupt Enable bit
    // ITB(9): Independent Time Base Mode bit
    // MDCS(8): Master Duty Cycle Register Select bit
    // DTC(7-6): Dead-Time Control bits
    // DTCP(5): Dead-Time Compensation Polarity bit
    // Unimplemented(4-3): Read as ?0?
    // CAM(2): Centrer-Aligned Mode Enable bit
    // XPRES(1): External PWMx Reset Control bit
    // IUE(0): Immediate Update Enable bit
    PWMCON1 = 0;                // 0b0000 0000 0000 0000
    PWMCON2 = 0;                // 0b0000 0000 0000 0000
    PWMCON3 = 0;                // 0b0000 0000 0000 0000

    PWMCON1bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled
    PWMCON2bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled
    PWMCON3bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled

    PWMCON1bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled
    PWMCON2bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled
    PWMCON3bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled

    PWMCON1bits.TRGIEN = 0;     // 0 = Trigger event interrupts are disabled
    PWMCON2bits.TRGIEN = 0;     // 0 = Trigger event interrupts are disabled
    PWMCON3bits.TRGIEN = 0;     // 0 = Trigger event interrupts are disabled

    PWMCON1bits.ITB = 1;        // 1 = PHASE1 register provides time base period
    PWMCON2bits.ITB = 1;        // 1 = PHASE2 register provides time base period
    PWMCON3bits.ITB = 1;        // 1 = PHASE3 register provides time base period

