microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    PWMCON1bits.MDCS = 0;       // 0 = PDC1 register provides duty cycle
    PWMCON2bits.MDCS = 0;       // 0 = PDC2 register provides duty cycle
    PWMCON3bits.MDCS = 0;       // 0 = PDC3 register provides duty cycle

    PWMCON1bits.DTC = 0;        // 00 = Positive dead time is actively applied
    PWMCON2bits.DTC = 0;        // 00 = Positive dead time is actively applied
    PWMCON3bits.DTC = 0;        // 00 = Positive dead time is actively applied

    PWMCON1bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled
    PWMCON2bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled
    PWMCON3bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled

    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC1/DTR1/ALTDTR1/PHASE1 registers are
                                // synchronized to the PWM1 period boundary
    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC2/DTR2/ALTDTR2/PHASE2 registers are
                                // synchronized to the PWM2 period boundary
    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC3/DTR3/ALTDTR3/PHASE3 registers are
                                // synchronized to the PWM3 period boundary

    // PHASEx: PWMx PRIMARY PHASE-SHIFT REGISTER
    // PHASEx register provides time base period, if PWMCONxbits.ITB = 1
    PHASE1 = LOOPTIME_TCY;      // Setting PWM period for PWM1 generator
    PHASE2 = LOOPTIME_TCY;      // Setting PWM period for PWM2 generator
    PHASE3 = LOOPTIME_TCY;      // Setting PWM period for PWM3 generator
    
    // DTRx: PWMx DEAD-TIME REGISTER
    DTR1 = 0x0000;              // Not used in centre aligned mode
    DTR2 = 0x0000;              // Not used in centre aligned mode
    DTR3 = 0x0000;              // Not used in centre aligned mode

    // ALTDTRx: PWMx ALTERNATE DEAD-TIME REGISTER
    // Provides 14-Bit Dead-Time Value for PWMx generator if PWMCONxbits.CAM = 1
    ALTDTR1 = DDEADTIME;        // Setting dead-time for PWM1 generator
    ALTDTR2 = DDEADTIME;        // Setting dead-time for PWM2 generator
    ALTDTR3 = DDEADTIME;        // Setting dead-time for PWM3 generator

    // PDCx: PWMx GENERATOR DUTY CYCLE REGISTER
    // Initialise the PWM duty cycle register
    PDC1 = MIN_DUTY;
    PDC2 = MIN_DUTY;
    PDC3 = MIN_DUTY;

    // IOCONx: PWMx I/O CONTROL REGISTER
    // PENH(15): PWMxH Output Pin Ownership bit
    // PENL(14): PWMxL Output Pin Ownership bit
    // POLH(13): PWMxH Output Pin Polarity bit
    // POLL(12): PWMxL Output Pin Polarity bit
    // PMOD(11:10): PWMx I/O Pin Mode bits
    // OVRENH(9): Override Enable for PWMxH Pin bit
    // OVRENL(8): Override Enable for PWMxL Pin bit
    // OVRDAT(7:6): Data for PWMxH, PWMxL Pins if Override is Enabled bits
    // FLTDAT(5:4): Data for PWMxH and PWMxL Pins if FLTMOD is Enabled bits.
    // CLDAT(1:0): Data for PWMxH and PWMxL Pins if CLMOD is Enabled bits
    // SWAP(1): SWAP PWMxH and PWMxL Pins bit
    // OSYNC(1): Output Override Synchronization bit
    IOCON1 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM1H,L pins)
    IOCON2 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM2H,L pins)
    IOCON3 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM3H,L pins)
    
    IOCON1bits.PENH = 1;    // 1 = PWM1H pin is active-high
    IOCON2bits.PENH = 1;    // 1 = PWM2H pin is active-high
    IOCON3bits.PENH = 1;    // 1 = PWM3H pin is active-high
    
    IOCON1bits.PENL = 1;    // 1 = PWM1L pin is active-high
    IOCON2bits.PENL = 1;    // 1 = PWM2L pin is active-high
    IOCON3bits.PENL = 1;    // 1 = PWM3L pin is active-high
    
    IOCON1bits.POLH = 0;    // 0 = PWM1H pin is active-high
    IOCON2bits.POLH = 0;    // 0 = PWM2H pin is active-high
    IOCON3bits.POLH = 0;    // 0 = PWM3H pin is active-high
    
    IOCON1bits.POLL = 0;    // 0 = PWM1L pin is active-high
    IOCON2bits.POLL = 0;    // 0 = PWM2L pin is active-high
    IOCON3bits.POLL = 0;    // 0 = PWM3L pin is active-high
   
    IOCON1bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM1H,L is driven LOW
    IOCON2bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM2H,L is driven LOW
    IOCON3bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM3H,L is driven LOW
    
    IOCON1bits.PMOD = 0;    // 0b00 = PWM1 pair is in the Complementary O/P mode
    IOCON1bits.PMOD = 0;    // 0b00 = PWM2 pair is in the Complementary O/P mode
    IOCON1bits.PMOD = 0;    // 0b00 = PWM3 pair is in the Complementary O/P mode

    // TRGCONx: PWMx TRIGGER CONTROL REGISTER
    // TRGDIV (15-12): Trigger Output Divider bits
    // Unimplemented(11-6): Read as ?0?
    // TRGSTRT(5:0): Trigger Postscaler Start Enable Select bits
    TRGCON1 = 0x0000;       // 0b0000 UUUU UU00 0000
    TRGCON2 = 0x0000;       // 0b0000 = Trigger output for every trigger event
    TRGCON3 = 0x0000;       // 0b0000 = Trigger output for every trigger event

    TRGCON1bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event
    TRGCON2bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event
    TRGCON3bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event

    TRGCON1bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled
    TRGCON2bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled
    TRGCON3bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled

    // TRIGx: PWMx PRIMARY TRIGGER COMPARE VALUE REGISTER
    // TRGCMP(15:0): Trigger Control Value bits
    // When the primary PWMx functions in local time base, 
    // this register contains the compare values that can trigger the ADC module.
    TRIG1 = PHASE1 - 1;         // Set to trigger ADC at the PWM edge
    TRIG2 = 0;                  // Set at centre of the PWM (not used)
    TRIG3 = 0;                  // Set at centre of the PWM (not used)
    
    // FCLCONx: PWMx FAULT CURRENT-LIMIT CONTROL REGISTER
    // Unimplemented(15): Read as '0'
    // CLSRC(14:10): Current-Limit Control Signal Source Select 
    // CLPOL(9): Current-Limit Polarity for PWM Generator bit
    // CLMOD (8): Current-Limit Mode Enable for PWM Generator bit
    // FLTSRC(7:3): Fault Control Signal Source Select for PWM Generator bits
    // FLTPOL (2): Fault Polarity for PWM Generator bit
    // FLTMOD (1:0): Fault Mode for PWM Generator bits 
    FCLCON1 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled) 
    FCLCON2 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled)
    FCLCON3 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled)
    
    FCLCON1bits.FLTSRC = 0x1F;  // 0b11111 = Fault SRC is FLT32
    FCLCON2bits.FLTSRC = 0x1F;  // 0b11111 = Fault SRC is FLT32
    FCLCON3bits.FLTSRC = 0x1F;  // 0b11111 = Fault SRC is FLT32
    
    FCLCON1bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    FCLCON2bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    FCLCON3bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    
    FCLCON1bits.FLTMOD = 1;     // 0b01 = forces PWM1H,L to FLTDAT values(cycle)
    FCLCON2bits.FLTMOD = 1;     // 0b01 = forces PWM2H,L to FLTDAT values(cycle)
    FCLCON3bits.FLTMOD = 1;     // 0b01 = forces PWM3H,L to FLTDAT values(cycle)

    // Configuring PWMx Generators Interrupts and Priority
    IPC23bits.PWM1IP = 4;       // PWM1 Interrupt Priority is 4
    IPC23bits.PWM2IP = 4;       // PWM2 Interrupt Priority is 4
    IPC24bits.PWM3IP = 4;       // PWM3 Interrupt Priority is 4

