microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    IFS5bits.PWM1IF = 0;        // Clear PWM1 Interrupt flag
    IFS5bits.PWM2IF = 0;        // Clear PWM1 Interrupt flag
    IFS6bits.PWM3IF = 0;        // Clear PWM1 Interrupt flag

    IEC5bits.PWM1IE = 0;        // Disable PWM1 Interrupt
    IEC5bits.PWM2IE = 0;        // Disable PWM2 Interrupt
    IEC6bits.PWM3IE = 0;        // Disable PWM3 Interrupt

    return;
}
// *****************************************************************************
/* Function:
    ChargeBootstarpCapacitors()

  Summary:
    Routine to initialise PWM generators 1,2,3 to charge bootstrap capacitors

  Description:
    Function to charge bootstrap capacitors initially

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void ChargeBootstarpCapacitors(void)
{
    uint16_t i = BOOTSTRAP_CHARGING_TIME;

    // Enable PWMs only on PWMxL ,to charge bootstrap capacitors initially
    // Hence PWMxH is over-ridden to "LOW"
    IOCON1bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled
    IOCON2bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled
    IOCON3bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled

    IOCON1bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H
    IOCON2bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H
    IOCON3bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H

    IOCON1bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM1L pin
    IOCON2bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM2L pin
    IOCON3bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM3L pin

    // PDCx: PWMx GENERATOR DUTY CYCLE REGISTER
    // Initialise the PWM duty cycle for charging
    PDC1 = PHASE1 - (MIN_DUTY + 3);
    PDC2 = PHASE1 - (MIN_DUTY + 3);
    PDC3 = PHASE1 - (MIN_DUTY + 3);

    PTCONbits.PTEN = 1;      // Enable PWM module for charging bootstrap CAPs

    while(i)
    {
        __delay_us(1);
        i--;
    }

    PTCONbits.PTEN = 0;      // Disable PWM module after charging

    // Reset modified PWM configurations after bootstrap charging
    // PDCx: PWMx GENERATOR DUTY CYCLE REGISTER
    // Re-initialise the PWM duty cycle register
    PDC1 = MIN_DUTY;
    PDC2 = MIN_DUTY;
    PDC3 = MIN_DUTY;

    IOCON1bits.OVRENH = 0;  // 1 = PWM generator provides data for PWM1H pin
    IOCON2bits.OVRENH = 0;  // 1 = PWM generator provides data for PWM2H pin
    IOCON3bits.OVRENH = 0;  // 1 = PWM generator provides data for PWM3H pin
}
// *****************************************************************************
/* Function:
    Init_ADC1

  Summary:
    Routine to initialise ADC 

  Description:
    Function initialises the ADC1 for simultaneously sampling four AD channels
    Measures offset on all channels .

  Precondition:
    None.

  Parameters:
    Pointer to ADC_OFFSET_T structure variable created to store ADC1 offset is
    passed to this function

  Returns:
    Structure will contain the averaged initial offset value of all 4 channels

  Remarks:
    None.
 */
void InitADCModule1(ADC_OFFSET_T *adc_offset)
{
    volatile uint16_t i = 0;

    // AD1CON1: ADC1 CONTROL REGISTER 1
    // ADON(15): ADC Operating Mode bit
    // Unimplemented(14,11): Read as '0'
    // ADSIDL(13): ADC Stop in Idle Mode bit
    // ADDMABM(12): DMA Buffer Build Mode bit
    // AD12B(10): 10-Bit or 12-Bit ADC Operation Mode bit
    // FORM(9-8): Data Output Format bits
    // SSRC(7-5>: Sample Clock Source Select bits
    // SSRCG(4): Sample Trigger Source Group bit
    // SIMSAM(3): Simultaneous Sample Select bit (only if CHPS<1:0> = 01 or 1x)
    // In 12-Bit Mode (AD12B = 1), SIMSAM is Unimplemented and is Read as '0'
    // ASAM(2): ADC Sample Auto-Start bit
    // SAMP(1): ADC Sample Enable bit
    // DONE(0): ADC Conversion Status bit
    AD1CON1 = 0;            // 0b0U00 U000 0000 0000 (0 = ADC is OFF)
    AD1CON1bits.AD12B = 0;   // 0 = 10-bit, 4-channel ADC operation possible
    AD1CON1bits.FORM = 3;   // 11 = Signed fractional(DOUT = sddd dddd dd00 0000
                            // Range is shown below for 10bit operation:
                            // 0b0111 1111 1100 0000 = 0.99804
                            // 0b0000 0000 0000 0000 = 0
                            // 0b1000 0000 0000 0000 = -1
    AD1CON1bits.SSRCG = 1;  // if SSRCG =  1,
    AD1CON1bits.SSRC = 0;   // 000 = PWM Generator 1 primary trigger compare
                            // ends sampling and starts conversion
    AD1CON1bits.SIMSAM = 1; // Samples CH0-CH3 simultaneously(if CHPS = 1x).
    AD1CON1bits.ASAM = 1;   // Sampling begins immediately after
                            // last conversion completes.SAMP bit is auto set.
    AD1CON1bits.DONE = 0;   // ADC conversion has not started

    // ADxCON2: ADCx CONTROL REGISTER 2
    // VCFG(15-13): Converter Voltage Reference Configuration bits
    // Unimplemented(12-11): Read as ?0?
    // CSCNA(10): Input Scan Select bit
    // CHPS(9-8): Channel Select bits
    // In 12-Bit Mode,CHPS<1:0> Bits are Unimplemented and are Read as ?0?
    // BUFS(7): Buffer Fill Status bit (only valid when BUFM = 1)
    // SMPI(6-2): Increment Rate bits
    // BUFM(1): Buffer Fill Mode Select bit
    // ALTS(0): Alternate Input Sample Mode Select bit
    AD1CON2 = 0;
    AD1CON2bits.VCFG = 0;   // ADC Voltage Reference VREFH = AVDD; VREFL = AVSS
    AD1CON2bits.CSCNA = 0;  // 0 = Does not scan inputs
    AD1CON2bits.CHPS = 2;   // 1x = Converts CH0, CH1, CH2 and CH3
    AD1CON2bits.SMPI = 0;   // x0000 = Generates interrupt after completion
                            // of every sample/conversion operation
    AD1CON2bits.BUFM = 0;   // 0 = Starts filling buffer from the Start address
    AD1CON2bits.ALTS = 0;   // 0 = Uses channel I/P selects for Sample MUXA

    // ADxCON3: ADCx CONTROL REGISTER 3
    // ADRC(15): ADC Conversion Clock Source bit
    // Unimplemented(14-13): Read as ?0?
    // SAMC(12-8): Auto-Sample Time bits
    // ADCS(7-0): ADC Conversion Clock Select bits
    AD1CON3 = 0;
    AD1CON3bits.ADRC = 0;       // 0 = Clock derived from system clock
    // ADC Conversion Clock Select bits
    // Tp*(ADCS<7:0> + 1) = Tp*(6+1) = 7 Tp = 1 Tad
    // 7 * (1/ Fp) = 7 * (1 / Fcy) = 100nSec
    AD1CON3bits.ADCS = ADC_MIN_ADCS_COUNTS;

    // ADxCON4: ADCx CONTROL REGISTER 4
    // Unimplemented(15-9,7-3): Read as ?0?
    // ADDMAEN(8): ADC DMA Enable bit
    // DMABL(2-0): Selects Number of DMA Buffer Locations per Analog Input bits
    AD1CON4 = 0;                   // Not used in the application

