microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    // ADxCHS123: ADCx INPUT CHANNEL 1, 2, 3 SELECT REGISTER
    // Unimplemented(15-11,7-3): Read as '0'
    // CH123SB(8): Channels 1, 2, 3 Positive Input Select for Sample B bits
    // CH123NB(10:9): Channels 1, 2, 3 Negative Input Select for Sample B bits
    // CH123SA(0): Channels 1, 2, 3 Positive Input Select for Sample A bits
    // CH123NA(2-1): Channels 1, 2, 3 Negative Input Select for Sample A bits
    AD1CHS123 = 0x0000;            // 0bUUUU U000 UUUU U000
    AD1CHS123bits.CH123SB = 0;     // Not used int the application
    AD1CHS123bits.CH123NB = 0;     // 0x = CH1, CH2, CH3 negative input is VREFL

    // Sets the simultaneously sampled channels
    // Refer periph.h for details
    AD1CHS123bits.CH123SA = ADC1_ANx_CH123;
    AD1CHS123bits.CH123NA = 0;     // 0x = CH1, CH2, CH3 negative input is VREFL
    
    // AD1CHS0: ADC1 INPUT CHANNEL 0 SELECT REGISTER
    // CH0NB(15): Channel 0 Negative Input Select for Sample MUXB bit
    // CH0SB(13-8): Channel 0 Positive Input Select for Sample MUXB bits(1,4,5)
    // CH0NA(7): Channel 0 Negative Input Select for Sample MUXA bit
    // CH0SA(5:0): Channel 0 Positive Input Select for Sample MUXA bits(1,4,5)
    // Unimplemented(14,6): Read as '0'
    AD1CHS0 = 0;
    AD1CHS0bits.CH0NB = 0;  // 0 = Channel 0 negative input is VREFL
    AD1CHS0bits.CH0SB = 0;  // 0b000000 (Not used in this application)
    AD1CHS0bits.CH0NA = 0;  // 0 = Channel 0 negative input is VREFL
    // CH0 is used for measuring voltage set by speed reference potentiometer
    AD1CHS0bits.CH0SA = ADC1_ANx_CH0;
    
    // AD1CSSH: ADC1 INPUT SCAN SELECT REGISTER HIGH
    // CSS(31-16): ADC Input Scan Selection bits
    AD1CSSH = 0;

    // AD1CSSL: ADC1 INPUT SCAN SELECT REGISTER LOW
    // CSS(15-0): ADC Input Scan Selection bits
    AD1CSSL = 0;

    // Configuring ADCx Generators Interrupts and Priority
    IPC3bits.AD1IP = 7;         // 0b111 ADC1 Interrupt Priority is 7
    IFS0bits.AD1IF = 0;         // 0 = Clear ADC1 Interrupt flag
    IEC0bits.AD1IE = 0;         // 0 = Disable ADC1 Interrupt

    AD1CON1bits.ADON = 1;

    // Time to Stabilize Analog Stage from ADC Off to ADC On
    __delay_us(ADC_TON_DELAY_MICROSEC);
    
    // Taking multiple sample to measure voltage offset in all the channels
    for (i = 0; i < 128; i++)
    {
        // Wait for the conversion to complete
        while (!AD1CON1bits.DONE);
        // Sum up the converted results
        iADCOffsetCH0 += ADC1BUF0;
        iADCOffsetCH1 += ADC1BUF1;
        iADCOffsetCH2 += ADC1BUF2;
        iADCOffsetCH3 += ADC1BUF3;
    }
    /* Averaging CHO result to find voltage offset*/
    adc_offset->ch0 = (int16_t)(iADCOffsetCH0 >> 7);
    /* Averaging CH1 result to find voltage offset*/
    adc_offset->ch1 = (int16_t)(iADCOffsetCH1 >> 7);
    /* Averaging CH2 result to find voltage offset*/
    adc_offset->ch2 = (int16_t)(iADCOffsetCH2 >> 7);
    /* Averaging CH3 result to find voltage offset*/
    adc_offset->ch3 = (int16_t)(iADCOffsetCH3 >> 7);
    
}
// *****************************************************************************
/* Function:
    Init_Peripherals()

  Summary:
    Routine initializes controller peripherals

  Description:
    Routine to initialize Peripherals used for Inverter Control

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPeripherals(void)
{
    /* Initialize comparator and amplifiers */
    InitAmplifiersComparator();
    /* Initialize PWM generators */
    InitPWMGenerators();
    /* Initialize the ADC used for sensing Inverter A parameters */
    InitADCModule1(&adcOffset);
    
    __delay_us(50);
}
